emacs/.emacs.d/config.org
#+title: GNU Emacs configuration
#+author: Sebastian Larsen Prehn
#+language: en
#+options: ':t toc:nil author:t email:nil num:t
#+property: header-args :results none
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))

*Last revised and exported on {{{latest-export-date}}}.*

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:


This is a GNU Emacs [[https://orgmode.org/][Org]] literate configuration file: a file intended to produce a working configuration by tangling Emacs Lisp code into, among other files, ~early-init.el~ and ~init.el~ using =Org-babel=.

The main purpose of this configuration file is to explain the choices I have made as clearly as possible.
This serves both to make sharing knowledge with others easier, and for my own sake,
as I have a tendency to forget the meaning or purpose of undocumented decisions.
It is also meant to be the one configuration file that I touch, and then I let changes made here tangle out to my =.el= files by running =C-c C-v C-t= instead of modifying each Emacs Lisp file itself.

This present configuration was first written in late 2025, after I had been using a more modular setup.
The modular setup had itself replaced an earlier literate configuration, which had accumulated many legacy hacks that were no longer necessary in modern Emacs, eventually making it difficult to tell what was safe to remove and what was not.
While I do not expect this configuration to be entirely free of such hacks, it is something I now actively try to avoid.
I will also try to force myself to actually version control it more actively, as I eventually stopped pushing as I always only modified a few lines at a time, losing the picture of what had brought weird behavior, and what had been there for a long time.

The following is written with GNU Emacs 30.2 in mind and has not been tested against other versions.

There is still room for improvement in this configuration, and I welcome any and all advice people would send my way.

The file is version-controlled via Git, and hosted on GitHub:
- GitHub: https://github.com/SebastianPrehn/dotfiles/tree/main/emacs/.emacs.d

** Acknowledgments

The Emacs community has a rich body of shared knowledge.
Throughout this configuration, I try to note when I am directly copying from, or drawing inspiration from, others.


I returned to a literate configuration after being inspired by Protesilaos Stavrou's [[https://protesilaos.com/codelog/2025-01-26-emacs-organise-init/][video about organising the init file]], in which he advocates maintaining a single, well-structured literate source that is later tangled into multiple files, combining the advantages of both approaches. Beyond this, his writing and teaching have been a consistent source of insight, both on Emacs and on broader questions of software, philosophy, and intentional practice. [[https://protesilaos.com/][Protesilaos Stavrou]]'s work is well worth engaging with for anyone interested in Emacs as a long-term tool.

[[https://github.com/minad/][Daniel Mendler]] is the author of many of the packages I rely on daily. His work appears frequently in my configuration, and his design sensibilities have strongly influenced how I think about Emacs Lisp myself.

[[https://sophiebos.io/][Sophie Bosio]] is someone whose configuration I often check when looking for small, thoughtful refinements, particularly given her preference for functional languages.

[[https://github.com/purcell][Steve Purcell]]'s Emacs configuration is one of the most frequently cited examples of a well-structured setup, and for good reason. I return to it periodically for ideas and patterns to copy.

[[https://github.com/rougier][Nicolas P. Rougier]] has produced some of my favorite visual and typographic refinements to Org mode, is a prolific writer and researcher, and his GitHub is a treasure trove of information.

Finally, [[https://sachachua.com/blog/][Sacha Chua]] was instrumental in getting me into Emacs in the first place. Her interviews, Emacs News, and her many blog posts have long served as an accessible way to learn about new packages and to stay connected to what is happening within the Emacs community.

#+toc: headlines 4

* early-init.el configuration
:PROPERTIES:
:CUSTOM_ID: early-init.el
:END:

When Emacs is started, it will normally attempt to load an /init file/, which is either a file named ~.~ or ~.emacs.el~ in the home directory of the user running the program, or a file named ~init.el~ in a sub-directory named ~.emacs.d~ in the home directory.
Emacs also attempt to load a second init file, called the /early init file/, if it exists.
This is called ~early-init.el~ in the ~.emacs.d~ directory, and the difference is that the early init file is loaded much earlier during the startup process.
This enables us to customize some things that are initialized before loading the regular init file, such as variables that affect the package initialization process.

** General settings for =early-init.el=

Below are some general settings for frames and basics for the toolkit, which I have shamelessly copied from [[https://protesilaos.com/emacs/dotemacs][Protesilaos' configuration]], as I thought each of these made sense.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize 'force
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-buffer-menu t)
#+end_src

The default menu bar, tool bar and scroll bar in order to have a more minimal initial window.

#+begin_src emacs-lisp :tangle "early-init.el"
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

** Garbage collection and tweaks to startup time

When it comes to garbage collection in Emacs, many a young Emacs users simply copy from their seniors.
Since I started my Emacs journey back in 2019, that'd make me one of them. Benefit of an older editor.
I thus copy [[https://protesilaos.com/emacs/dotemacs#h:50d28f3c-3ada-4db5-b830-bbbbee7fec4e][Protesilaos]] once again.

As he himself notes, maximizing the threshold during startup seems to make Emacs boot a bit faster, which makes sense since it will have to call garbage collection fewer times.

We arrange for the relevant values to be set very high during startup, and then brought down to something practical once Emacs is done loading.
We also tweak ~file-name-handler-alist~ and ~vc-handled-backends~ to increase startup speed.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.5)

  (defvar slp-emacs--file-name-handler-alist file-name-handler-alist)
  (defvar slp-emacs--vc-handled-backends vc-handled-backends)

  (setq file-name-handler-alist nil
        vc-handled-backends nil)

  (add-hook 'emacs-startup-hook
  	  (lambda ()
  	    (setq gc-cons-threshold (* 100 100 8)
  		  gc-cons-percentage 0.1
  		  file-name-handler-alist slp-emacs--file-name-handler-alist
  		  vc-handled-backends slp-emacs--vc-handled-backends)))
#+end_src

** Package cache

I use =package.el= to handle Emacs packages. I have used [[https://github.com/radian-software/straight.el][straight.el]] and [[https://github.com/progfolio/elpaca][elpaca]] in the past, and while they're marvelous tools, they're overkill for what I need my package manager to do at the moment.
I used to use them for their capabilities to install git packages independently of ELPA, MELPA and other package repositories, but ~use-package~ now has ~:vc~ built-in, which handles exactly that requirement should I need it again.

Here, I found a nice detail mentioned by [[https://tony-zorman.com/posts/use-package-vc.html][Tony Zorman]] about the fact that by default, ~:vc~ installs the latest /release/ of a package, whereas I would often like to install the most recent version based on commit instead.
To do this, ~:rev~ can be used with the ~:newest~ argument. An example taken from Zorman below:

#+begin_src emacs-lisp :tangle no
  (use-package vertico
    :vc (:url "https://github.com/minad/vertico"
         :rev :newest
         :lisp-dir "extensions/"))
#+end_src

I initialize the installed packages in this ~early-init.el~ file by using the available cache. This leads to faster startup times after the initial loading of a file.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq package-enable-at-startup t)
#+end_src


* init.el configuration
:PROPERTIES:
:CUSTOM_ID: init.el
:END:

The ~init.el~ file is responsible for the remainder of the setup: Setup of the package manager, module loading, and a handful of defaults intended to bring Emacs' behavior in line with more modern usage expectations.

** Setup package manager

Setting up ~package.el~ is straightforward: given that ~package-enable-at-startup~ was set to ~t~ in the /early init file/, we do not need to require it or initialize it here on Arch Linux, but I found that it would not work correctly on =MacOS= unless I used ~package-initialize~.
We add /MELPA/ as an additional package archive to ELPA.

#+begin_src emacs-lisp :tangle "init.el"
  ;;; Setup package manager archives
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)
#+end_src

** Load modules

Here, the configuration establishes a list of inputs, currently just the =modules= directory, for all user-defined code.
These inputs are added to the ~load-path~ early during startup, keeping the top-level ~init.el~ focused on coordination while moving package customization into self-contained Emacs Lisp files.

#+begin_src emacs-lisp :tangle "init.el"
  (dolist (dir '("modules"))
    (let ((path (locate-user-emacs-file dir)))
      (when (file-directory-p path)
        (add-to-list 'load-path path))))
#+end_src

Once the =modules= directory is available, the desired modules are listed explicitly below. Enabling or disabling functionality is thus handled by this list, rather than needing to change the =Babel= source.

#+begin_src emacs-lisp :tangle "init.el"
  (require 'slp-completion)
  (require 'slp-org)
  (require 'slp-interface)
  (require 'slp-programming)
  (require 'slp-dired)
  (require 'slp-spellcheck)
  (require 'slp-vc)
#+end_src

** Defaults

This section establishes a small set of general assumptions about how Emacs should behave when faced with common choices.

By default, indentation should use spaces rather than tabs, unless a major mode or file explicitly specifies otherwise.

#+begin_src emacs-lisp :tangle "init.el"
  (setq-default indent-tabs-mode nil)
#+end_src

UTF-8 is explicitly configured as the preferred encoding throughout, even where it would already be the default.

#+begin_src emacs-lisp :tangle "init.el"
  (set-default-coding-systems 'utf-8)
  (prefer-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
#+end_src

For spell-checking and general explicitness, we set the standard language environment as English.

#+begin_src emacs-lisp :tangle "init.el"
  (set-language-environment "English")
#+end_src

Finally, the column number is displayed to aid precision when referring to locations in a buffer.
Window decorations are disabled, and dialog boxes are handled within Emacs rather than via the system GUI.

#+begin_src emacs-lisp :tangle "init.el"
  (setq column-number-mode 1)
  (setq use-dialog-box nil)
  (setq frame-resize-pixelwise t)
  (setq default-frame-alist '((undecorated . t)))
#+end_src

*** Make Emacs use the $PATH

By default, Emacs will not always be able to find all the programs that exist in your ~$PATH~.
Luckily, Steve Purcell has made a package which neatly solves this problem with the =exec-path-from-shell= package.

Furthermore, we make it so that ~$MANPATH~, ~$PATH~ and ~exec-path~ is set from the shell, but only when executed in a GUI frame on OS X and Linux.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package exec-path-from-shell
    :ensure t
    :config
    ((dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO"))
    (add-to-list 'exec-path-from-shell-variables var))))
  
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
#+end_src

*** Emacs legacy oddities

Emacs prioritizes portability and long-standing behavior, which can result in defaults that feel surprising on modern systems.
Since this configuration targets contemporary environments exclusively, a small number of options are adjusted to better match current user expectations.

#+begin_src emacs-lisp :tangle "init.el"
  (delete-selection-mode 1) ; Delete selection when typing
  (global-auto-revert-mode 1) ; Auto update buffer when file changes outside of Emacs (vc etc.)
  (setq vc-follow-symlinks t) ; Follow symlinks without prompting
  (setq-default tab-width 4) ; Reasonable default tab width most languages will override
  (setq yes-or-no-p #'y-or-n-p) ; Use y/n instead of yes/no
#+end_src

