emacs/.emacs.d/config.org
*** Backup files and lock-files

Emacs tries to lock down files so that they are not modified by other programs by default and keeps backups.
Since anything I work with is under version control, I do not need Emacs to keep backups, as this behavior more often hinders my workflow than it helps.

#+begin_src emacs-lisp :tangle "init.el"
  (setq make-backup-files nil)
  (setq create-lockfiles nil)
#+end_src

*** Custom files

Emacs has a graphical interface for modifying variables that are intended for user configuration which can be used instead of writing Emacs Lisp code.
While I rarely use this interface, any changes made through it are redirected to a separate ~custom.el~ file, which is loaded explicitly.

#+begin_src emacs-lisp :tangle "init.el"
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (load custom-file :no-error-if-file-is-missing)
#+end_src

*** MacOS keybindings

MacOS has a different keyboard layout, with its =control=, =option= and =command= keys, and these usually require different keypresses than I'm used to.
I thus change the keybindings when Emacs detects itself running on =MacOS=

#+begin_src emacs-lisp :tangle "init.el"
  (when (eq system-type 'darwin)
        (setq mac-command-modifier 'meta
              mac-option-modifier nil
              mac-control-modifier 'control
              mac-right-command-modifier 'super
              mac-right-control-modifier 'hyper))
#+end_src

* Modules

** Interface

*** Fonts

**** Icon fonts

The following will setup complementary icons (the popular [[https://www.nerdfonts.com/][nerd-icons]]) for some of the packages used in this configuration.

After initial startup of Emacs, the command ~nerd-icons-install-fonts~ must be called via ~M-x~.

#+begin_src emacs-lisp :tangle "modules/slp-interface.el"
  (use-package nerd-icons
    :ensure t)

  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :config
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package nerd-icons-corfu
    :ensure t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

  (use-package nerd-icons-dired
    :ensure t
    :hook
    (dired-mode . nerd-icons-dired-mode))

  (use-package nerd-icons-ibuffer
    :ensure t
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

*** Modeline

While maintaining my own configuration, I occasionally borrow ideas from Doom Emacs, which provides a number of well-integrated features.
Its modeline is one such feature, and I use it here for its simplicity and polished appearance.

#+begin_src emacs-lisp :tangle "modules/slp-interface.el"
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-project-detection 'auto)
    (doom-modeline-icon t)
    (doom-modeline-major-mode-icon t)
    (doom-modeline-major-mode-color-icon t)
    (doom-modeline-buffer-modification-icon t)
    (doom-modeline-lsp-icon t)
    (doom-modeline-time-icon t))
#+end_src

*** Themes

Choosing a theme is one of the more subjective aspects of an Emacs configuration, but it has a tangible impact on readability and long-term comfort.

I use the [[https://github.com/ogdenwebb/emacs-kaolin-themes][kaolin-themes]] package, which I think strikes a good balance between expressiveness and readability.

A small number of theme options are enabled to improve visual clarity, and to better distinguish between different types of lines.

#+begin_src emacs-lisp :tangle "modules/slp-interface.el"
  (use-package kaolin-themes
    :ensure t
    :custom
    (kaolin-themes-italic-comments t)
    (kaolin-themes-hl-line-colored t)
    (kaolin-themes-distinct-fringe t)
    (kaolin-themes-git-gutter-solid t)
    :config
    (load-theme 'kaolin-dark t))
#+end_src

*** Provide interface

#+begin_src emacs-lisp :tangle "modules/slp-interface.el"
  (provide 'slp-interface)
#+end_src

** Completion

this section configures the completion system used throughout Emacs.
The setup follows the modern, modular approach centered around the built-in completion framework, with small, focused packages responsible for presentation, matching, annotations, and actions.

*** Vertico

The =vertico= package provides a minimal, vertical completion UI for the minibuffer.
Rather than replacing Emacs' completion system, it focuses solely on presenting candidates in a clear, efficient layout.

=vertico= is intentionally small and performs well out of the box, while still allowing fine-grained control of its behavior.
Here, cycling is enabled to allow wrapping around the candidate list, while automatic resizing is disabled to keep the minibuffer height stable.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el" :mkdirp yes
  ;;; Vertico
  (use-package vertico
    :ensure t
    :config
    (setq vertico-cycle t)
    (setq vertico-resize nil)
    (vertico-mode 1))
#+end_src

*** Marginalia

The =marginalia= package adds contextual annotations to minibuffer completion candidates.
These annotations adapt to the type of candidate being displayed, such as files, buffers, or commands, and provide useful metadata alongside the main completion text.

This additional context reduces ambiguity and makes it easier to select the correct candidate.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode 1))
#+end_src

*** Orderless

The =orderless= package enables out-of-order pattern matching in the minibuffer.
Completion input is split on spaces and matched against candidates in any order, using either literal substrings or regular expressions.

For example, typing "ins pac" will match both ~package-install~ and ~package-menu-mark-install~, without requiring precise recall of the command name.
This significantly reduces the cognitive load of remembering exact identifiers.

Emacs supports multiple completion styles, and =orderless= is configured here as the primary one, with a small exception for file completion where partial completion remains more convenient.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion))))
    (completion-category-defaults nil)
    (orderless-ignore-case t))
#+end_src

*** Consult

The =consult= package provides enhanced variants of many built-in Emacs commands, all integrated with the minibuffer completion system.
A particularly useful feature is its live preview mechanism, which displays contextual information about the currently selected candidate in another window.

The following key bindings enable a selection of commands I use frequently for searching buffers, files and outlines.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package consult
    :ensure t
    :bind (;; A recursive grep
  	 ("M-s M-g" . consult-grep)
  	 ;; Search for files names recursively
  	 ("M-s M-f" . consult-find)
  	 ;; Search through the outline (headings) of the file
  	 ("M-s M-o" . consult-outline)
       ;; Search through the imenu entries
       ("M-g i" . consult-imenu)
  	 ;; Search the current buffer
  	 ("C-s" . consult-line) ; overrides I-search. TODO check back with this in a month 2026/01/03
       ;; Search backward
       ("C-r" . consult-line-backward)
  	 ;; Switch to another buffer, or bookmarked file, or recently opened file
  	 ("C-x b" . consult-buffer))) ; replaces default switch-to-buffer
#+end_src

*** Embark

The =embark= package lets you target the thing or context at point and select an action to perform on it.
The ~embark-act~ command can be seen as a keyboard-based version of a right-click contextual menu.
It acts as a prefix for a keymap offering relevant actions to use on a target determined by the context presented in a minibuffer.

When inside the minibuffer, =embark= can collect/export the contents to a fully fledged Emacs buffer.
The ~embark-collect~ command retains the original behavior of the minibuffer, meaning that if you navigate over the candidate at hit /RET/, it will do what the minibuffer would have done.
In contrast, the ~embark-export~ command reads the metadata to figure out what category this is and places them in a buffer whose major mode is specialized for that type of content.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package embark
    :ensure t
    :bind (("C-." . embark-act)
  	 :map minibuffer-local-map
  	 ("C-c C-c" . embark-collect)
  	 ("C-c C-e" . embark-export)))
#+end_src

**** Embark-consult
[[https://elpa.gnu.org/packages/embark-consult.html][Documentation]]

The =embark-consult= package adds support for exporting a list of grep results via =consult= when using =embark=.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package embark-consult
    :after embark consult
    :ensure t)
#+end_src

*** wgrep

The =wgrep= package allows grep results to be edited directly from a =grep-mode= buffer.
After toggling writable mode, changes can be applied in place and committed or aborted using ~C-c C-c~ or ~C-c C-k~.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package wgrep
    :ensure t
    :bind ( :map grep-mode-map
  	  ("e" . wgrep-change-to-wgrep-mode)
  	  ("C-x C-q" . wgrep-change-to-wgrep-mode)
  	  ("C-c C-c" . wgrep-finish-edit)))
#+end_src

*** Save history and recently visited files

The built-in =savehist-mode= saves minibuffer histories.
The built-in =recentf-mode= keeps track of recently visited files.
Vertico can use this information to put recently selected options at the top simply by enabling
these built-in options.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  ;;; `savehist' (minibuffer and related histories)
  (setq savehist-file (locate-user-emacs-file "savehist"))
  (setq history-length 100)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history t)
  (with-eval-after-load 'savehist
    (add-to-list 'savehist-additional-variables 'kill-ring))
  (savehist-mode 1)
#+end_src

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (recentf-mode 1)
#+end_src

*** Corfu

The [[https://github.com/minad/corfu][corfu]] package provides a lightweight popup interface for in-buffer completion.
It uses the same completion infrastructure as the minibuffer, but is designed for interactive code and text completion.

Only the core functionality is configured here, with additional language-specific support provided in the Programming subsection.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package corfu
    :ensure t
    :custom
    (corfu-cycle t)
    (corfu-auto t) ;; Enable auto completion
    :init
    (global-corfu-mode))
#+end_src

Following the =corfu= example configuration, we set up a few extra useful configurations.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package emacs
    :custom
    ;; TAB cycle if there are only few candidates
    (completion-cycle-threshold 4)
    ;; Enable indentation+completion using the TAB key
    (tab-always-indent 'complete)
    ;; Disable Ispell completion function to try cape-dict instead as an alternative
    (text-mode-ispell-word-completion nil)
    ;; Hide commands in M-x which do not apply to the current mode. This is not a corfu feature, but rather just a tip from Minad
    (read-extended-command-predicate #'command-completion-default-include-p))
#+end_src

*** cape

[[https://github.com/minad/cape][cape]] provides /Completion At Point Extensions/ which can be used in combination with Corfu, and can utilize Company as well.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package cape
    :ensure t
    ;; Bind prefix keymap providing all Cape commands under one key. Press C-c p ? for help
    :bind ("C-c p" . cape-prefix-map)
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-dict)
    (add-hook 'completion-at-point-functions #'cape-elisp-block))
#+end_src

**** Company adapter

Cape provides the adapter ~cape-company-to-capf~ for Company backends.
The adapter transforms Company backends to Capfs which are understood by the built-in Emacs completion mechanism.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  ;; Use Company backends as Capfs
  (when (require 'cape nil 'noerror)
    (setq-local completion-at-point-functions
                (mapcar #'cape-company-to-capf
                        (list #'company-files #'company-keywords #'company-dabbrev))))
#+end_src

*** which-key

[[https://github.com/justbur/emacs-which-key][which-key]] is a minor mode for Emacs that displays key bindings based on already entered incomplete commands in a popup.
It is very useful for especially longer key sequences.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package which-key
    :ensure t
    :config
    (which-key-mode))
#+end_src

