emacs/.emacs.d/init.el

(setq make-backup-files nil)
(setq create-lockfiles nil)

(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file :no-error-if-file-is-missing)

(when (eq system-type 'darwin)
      (setq mac-command-modifier 'meta
            mac-option-modifier nil
            mac-control-modifier 'control
            mac-right-command-modifier 'super
            mac-right-control-modifier 'hyper))
