emacs/.emacs.d/config.org
*** IBuffer

=IBuffer= is a built-in package which can group buffers and display them neatly.

This configuration is heavily inspired by, and adapted from, the setup described by [[https://olddeuteronomy.github.io/post/emacs-ibuffer-config/][The Emacs Cat]].

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package ibuffer
    :ensure nil
    :bind
    ("C-x C-b" . ibuffer)
    :custom
    (ibuffer-expert nil) ; set to t once I've gotten used to IBuffer
    (ibuffer-display-summary nil)
    (ibuffer-use-other-window nil)
    (ibuffer-show-empty-filter-groups nil)
    (ibuffer-default-sorting-mode 'filename/process)
    (ibuffer-title-face 'font-lock-doc-face)
    (ibuffer-use-header-line t)
    (ibuffer-default-hrink-to-minimum-size nil)
    ;; IBuffer formats
    (ibuffer-formats
     '((mark modified read-only locked " "
             (name 30 30 :left :elide)
             " "
             (size 9 -1 :right)
             " "
             (mode 16 16 :left :elide)
             " " filename-and-process)
       (mark " "
             (name 16 -1)
             " " filename)))
    ;; Saved filter groups
    (ibuffer-saved-filter-groups
     '(("Main"
        ("Directories" (mode . dired-mode))
        ("Python" (or
                   (mode . python-ts-mode)
                   (mode . python-mode)))
        ("Build" (or
                  (mode . make-mode)
                  (mode . makefile-gmake-mode)
                  (name . "^Makefile$")
                  (mode . change-log-mode)))
        ("Scripts" (or
                    (mode . shell-script-mode)
                    (mode . shell-mode)
                    (mode . sh-mode)
                    (mode . lua-mode)
                    (mode . bat-mode)))
        ("Config" (or
                   (mode . conf-mode)
                   (mode . conf-toml-mode)
                   (mode . toml-ts-mode)
                   (mode . conf-windows-mode)
                   (name . "^\\.clangd$")
                   (name . "^config\\.toml$")
                   (mode . yaml-mode)))
        ("Web" (or
                (mode . mhtml-mode)
                (mode . html-mode)
                (mode . web-mode)
                (mode . nxml-mode)))
        ("CSS" (or
                (mode . css-mode)
                (mode . sass-mode)))
        ("JS" (or
               (mode . js-mode)
               (mode . rjsx-mode)))
        ("Markup" (or
                   (mode . markdown-mode)
                   (mode . adoc-mode)))
        ("Org" (mode . org-mode))
        ("LaTeX" (name . "\\.tex$"))
        ("Magit" (or
                (mode . magit-blame-mode)
                (mode . magit-cherry-mode)
                (mode . magit-diff-mode)
                (mode . magit-log-mode)
                (mode . magit-process-mode)
                (mode . magit-status-mode)))
      ("Apps" (or
               (mode . elfeed-search-mode)
               (mode . elfeed-show-mode)))
      ("Fundamental" (or
                      (mode . fundamental-mode)
                      (mode . text-mode)))
      ("Emacs" (or
                (mode . emacs-lisp-mode)
                (name . "^\\*Help\\*$")
                (name . "^\\*Custom.*")
                (name . "^\\*Org Agenda\\*$")
                (name . "^\\*info\\*$")
                (name . "^\\*scratch\\*$")
                (name . "^\\*Backtrace\\*$")
                (name . "^\\*Messages\\*$"))))))
  :hook
  (ibuffer-mode . (lambda ()
                    (ibuffer-switch-to-saved-filter-groups "Main"))))
#+end_src

*** Tempel

[[https://github.com/minad/tempel][Tempel]] is a template package for Emacs, which uses the syntax of the Emacs Tempo library.
=Tempel= takes advantage of the standard ~completion-at-point-functions~ and works well with the rest of Minad's packages.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  ;;; Configure Tempel
  (use-package tempel
    :ensure t
    :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
           ("M-*" . tempel-insert))
    :init
    ;; Setup completion at point
    (defun tempel-setup-capf ()
      ;; Add the Tempel Capf to `completion-at-point-functions'.
      ;; only triggers on exact matches. We add `tempel-expand' before the
      ;; main programming mode Capf, such that it will be tried first.
      (setq-local completion-at-point-functions
                  (cons #'tempel-expand completion-at-point-functions)))
    (add-hook 'conf-mode-hook 'tempel-setup-capf)
    (add-hook 'prog-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf))
#+end_src

**** Tempel collection

=Tempel= also has a user-repository of ready-made templates for Tempel, which can be found in the package =tempel-collection=.
We add that here.

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (use-package tempel-collection
    :ensure t
    :after tempel)
#+end_src

*** Provide completion

#+begin_src emacs-lisp :tangle "modules/slp-completion.el"
  (provide 'slp-completion)
#+end_src


** Programming

This section configures Emacs for programming languages I use.
It relies on tree-sitter modes for modern syntax parsing where available, and uses Eglot as the Language Server Protocol client.

*** Language Server Protocol (LSP)

Although I have previously used [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]], I chose Eglot for this configuration.

[[https://github.com/joaotavora/eglot][Eglot]] is built into Emacs and provides a lightweight, standards-compliant Language Server Protocol client.
The guiding principle is to prefer built-in ~*-ts-mode~whenever possible and to use hooks to automatically integrate LSP functionality with major modes.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  ;;; Eglot
  (use-package eglot
    :ensure nil) ;; built-in
#+end_src

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (setq treesit-language-source-alist
        '((rust "https://github.com/tree-sitter/tree-sitter-rust")
          (zig "https://github.com/tree-sitter/zig-tree-sitter")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx")
          (markdown "https://github.com/tree-sitter-grammars/tree-sitter-markdown")))
#+end_src

We can install these grammars with:

#+begin_example
M-x treesit-install-language-grammar
#+end_example

**** Prefer tree-sitter modes when available

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  ;;; Prefer tree-sitter modes when available
  (setq major-mode-remap-alist
        '((rust-mode . rust-ts-mode)
          (zig-mode . zig-ts-mode)
          (typescript-mode . typescript-ts-mode)
          (js-mode . js-ts-mode)
          (markdown-mode . markdown-ts-mode)))
#+end_src

*** Language support

**** Markdown

Markdown is a lightweight markup language for creating formatted text.
It has evolved since its creation in 2004 into several variants, each with minor syntactic differences.
This configuration uses [[https://jblevins.org/projects/markdown-mode/][markdown-mode]] for editing, and [[https://pandoc.org/][Pandoc]] as the processor.

Keybindings are grouped by prefixes based on their function.
List all keybindings by pressing ~C-c C-h~.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (use-package markdown-mode
    :ensure t
    :mode ("README\\.md\\'" . gfm-mode)
    :init
    (setq markdown-command "pandoc")
    :bind (:map markdown-mode-map
                ("C-c C-e" . markdown-do))
    :config
    (setq markdown-fontify-code-blocks-natively t))
#+end_src

**** Zig

Zig is a general-purpose programming language still under active development.
This configuration enables =zig-mode= and integrates it with Eglot for LSP support.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (use-package zig-mode
    :ensure t
    :hook (zig-ts-mode . eglot-ensure))
#+end_src

**** Rust

[[https://rust-lang.org/][Rust]] is a strongly typed systems programming language I use frequently.
=rust-ts-mode= is preferred over the legacy mode, with Eglot providing LSP features such as formatting and inlay hints.
Clippy is configured to provide linting and suggestions on save.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (use-package rust-ts-mode
    :ensure nil ; built-in
    :hook ((rust-ts-mode . eglot-ensure)))

  (defun slp/rust-format-on-save ()
    "Enable formatting on save once Eglot is managing the buffer."
    (when (eglot-managed-p)
      (add-hook 'before-save-hook #'eglot-format-buffer nil t)))

  (add-hook 'eglot-managed-mode-hook #'slp/rust-format-on-save)
  (add-hook 'eglot-managed-mode-hook #'eglot-inlay-hints-mode)
#+end_src

***** Clippy

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '(rust-ts-mode . ("rust-analyzer"))))

  (setq eglot-workspace-configuration
        '((:rust-analyzer
           (:check (:command "clippy")))))
#+end_src


***** project.el fix

=project.el= has trouble recognizing ~Cargo.toml~, so we make sure it is explicitly told about this filetype.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (setq project-vc-extra-root-markers '("Cargo.toml"))
#+end_src


**** Typescript

Typescript extends JavaScript with static typing.
This configuration uses =typescript-ts-mode= and =tsx-ts-mode= with Eglot hooks for LSP support.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (use-package typescript-mode
    :ensure t
    :hook ((typescript-ts-mode . eglot-ensure)
           (tsx-ts-mode . eglot-ensure)))
#+end_src

**** Futhark

I use Futhark for university, and =futhark-mode= provides syntax highlighting, automatic indentation and interaction with an inferior ~futhark repl~ process.

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (use-package futhark-mode
    :ensure t
    :hook ((futhark-mode . eglot-ensure)
           (futhark-mode . futhark-fmt-on-save-mode)))
#+end_src

*** Provide programming

#+begin_src emacs-lisp :tangle "modules/slp-programming.el"
  (provide 'slp-programming)
#+end_src

** Org

All Org Mode-related configuration in contained in ~slp-org.el~ and tangled from this file.

Org Mode is one of the most useful features of Emacs, and at its core, it is a lightweight markup language.
This entire file is written using its syntax, and allows export, formatting, code blocks which can be executed in a document otherwise containing prose, and much more.

*** General settings

#+begin_src emacs-lisp :tangle "modules/slp-org.el" :mkdirp yes
  ;;; General org settings
  (setq org-directory (expand-file-name "~/Documents/org/"))
  (setq org-imenu-depth 7)

  (setq org-ellipsis " ▼")
  (setq org-special-ctrl-a/e nil)
  (setq org-special-ctrl-k nil)
  (setq org-M-RET-may-split-line '((default . nil)))
  (setq org-hide-emphasis-markers nil)
  (setq org-hide-macro-markers nil)
  (setq org-hide-leading-stars nil)
  (setq org-cycle-seperator-lines 0)
  (setq org-structure-template-alist
        '(("s" . "src")
  	("e" . "src emacs-lisp")
  	("E" . "src emacs-lisp :results value code :lexical t")
  	("t" . "src emacs-lisp :tangle FILENAME")
  	("T" . "src emacs-lisp :tangle FILENAME :mkdirp yes")
  	("x" . "example")
  	("X" . "export")
  	("q" . "quote")))
  (setq org-fold-catch-invisible-edits 'show)
  (setq org-return-follows-link nil)
  (setq org-loop-over-headlines-in-active-region 'start-level)
  (setq org-insert-heading-respect-content t)
  (setq org-read-date-prefer-future 'time)
  (setq org-highlight-latex-and-related nil) ; other options affect elisp regexp in src blocks
  (setq org-fontify-quote-and-verse-blocks t)
  (setq org-fontify-whole-block-delimiter-line t)
  (setq org-track-ordered-property-with-tag t)
#+end_src

*** Provide Org

#+begin_src emacs-lisp :tangle "modules/slp-org.el"
  (provide 'slp-org)
#+end_src

