emacs/.emacs.d/config.org
** Dired

Emacs comes with =Dired=, a built-in file manager.
The following settings define some basic refinements to the behavior of common operations for copying, renaming and deleting files.

=Dired= displays extensive details by default, which are hidden here using ~hide-hide-details-mode~ for a cleaner view.

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq dired-dwim-target t))
#+end_src

The =dired-subtree= package allows expanding and collapsing directory subtrees directly in the Dired buffer using =TAB= or =SHIFT-TAB=.

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (use-package dired-subtree
    :ensure t
    :after dired
    :bind
    ( :map dired-mode-map
      ("<tab>" . dired-subtree-toggle)
      ("TAB" . dired-subtree-toggle)
      ("<backtab>" . dired-subtree-remove)
      ("S-TAB" . dired-subtree-remove))
    :config
    (setq dired-subtree-use-backgrounds nil))
#+end_src

*** Provide Dired

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (provide 'slp-dired)
#+end_src

** Spellchecking

I write a lot of prose in Emacs (as evident from the fact I write prose to configure Emacs itself), and thus spellchecking is a nice feature to have.
A general-purpose spellchecker complements =Cape=, highlighting misspelled words in the visible portion of buffers, particularly useful when editing prose or collaborative documents.

Using many of his other packages for their excellent and well-documented features, Daniel Mendler's [[https://github.com/minad/jinx][jinx]] package stood out to me.

On Arch Linux, it requires the packages ~enchant~ and ~pkgconf~ to be installed already.

#+begin_src emacs-lisp :tangle "modules/slp-spellcheck.el"
  (use-package jinx
    :ensure t
    :hook (emacs-startup . global-jinx-mode)
    :bind (("M-$" . jinx-correct)
           ("C-M-$" . jing-languages)))
#+end_src

*** Provide Spellchecking

#+begin_src emacs-lisp :tangle "modules/slp-spellcheck.el"
  (provide 'slp-spellcheck)
#+end_src


** Version Control

Version control tracks changes to files over time. I use it extensively, both for code and prose, often publishing work on platforms like GitHub.

Emacs has many great packages to make version control easier and useful for most workflows, and mine heavily revolves around [[https://magit.vc/][Magit]] by Jonas Bernoulli.

*** Highlight differences between upstream and local

[[https://github.com/dgutov/diff-hl][diff-hl]] is a package which highlights uncommitted changes on the side of the window, and allows one to jump between and revert them selectively.
It also works for =Dired=.

It works on "hunks", which is another word for current local versions against a version-controlled upstream.

Since I want to really utilize the packages I install and enable more, I have decided to list =diff-hl='s commands in an effort to remember these exist, as well as how to invoke them.

| Provided commands             | Keybinding | Explanation                                                                                                                                                       |
|-------------------------------+------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| ~diff-hl-diff-goto-hunk~      | ~C-x v =~  | Shows a side-by-side diff of the current "hunk" and the last committed version.                                                                                   |
| ~diff-hl-revert-hunk~         | ~C-x v n~  | Reverts the current hunk to its last committed state.                                                                                                             |
| ~diff-hl-previous-hunk~       | ~C-x v [~  | Moves the cursor to the previous hunk in the buffer.                                                                                                              |
| ~diff-hl-next-hunk~           | ~C-x v ]~  | Moves the cursor to the next hunk in the buffer.                                                                                                                  |
| ~diff-hl-show-hunk~           | ~C-x v *~  | Shows a popup of the hunk at point, usually in a temporary window or overlay.                                                                                     |
| ~diff-hl-stage-current-hunk~  | ~C-x v S~  | Stages the current hunk for commit.                                                                                                                               |
| ~diff-hl-set-reference-rev~   |            | Sets a reference revision for comparison. Normally, diff-hl compares against HEAD. With this command, one can set a specific commit or branch to compary against. |
| ~diff-hl-reset-reference-rev~ |            | Resets the reference revision back to the default.                                                                                                                |
| ~diff-hl-unstage-file~        |            | Unstages all changes in the current file.                                                                                                                         |

I enable it globally, as more than just my code is version-controlled, and thus it is useful in almost any buffer I open.
Hooks are added to integrate =diff-hl= with =Magit= for automatic updates.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package diff-hl
    :after magit
    :ensure t
    :hook ((magit-pre-refresh . diff-hl-magit-pre-refresh)
           (magit-post-refresh . diff-hl-magit-post-refresh))
    :config
    (global-diff-hl-mode))
#+end_src

*** Magit

[[https://magit.vc/][Magit]] is a complete text-based user interface to =Git= (a so-called "Git Porcelain").

Details TBD.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package magit
    :ensure-system-package git
    :ensure t
    :bind (("M-g b" . magit-blame-addition)
           :map magit-mode-map
           ("C-M-f" . magit-section-forward)
           ("C-M-b" . magit-section-backward))
    :config
    (setq magit-mode-quit-window 'magit-restore-window-configuration
          magit-auto-revert-mode t))
#+end_src

*** Forge

Forge adds GitHub/GitLab integration, configured here (details TBD).

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package forge
    :ensure t
    :after magit)
#+end_src

*** Blamer

Blamer adds a blame plugin inspired by VS Code's GitLens, which shows details for the currently selected line(s) regarding what commit the line is from, and who wrote it.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package blamer
    :ensure t
    :after magit
    :bind (("C-c g i" . blamer-show-commit-info)
           ("C-c g b" . blamer-show-posframe-commit-info))
    :custom
    (blamer-idle-time 0.3)
    (blamer-min-offset 4)
    (blamer-max-commit-message-length 100)
    (blamer-datetime-formatter "[%s]")
    (blamer-commit-formatter " ● %s")
    :custom-face
    (blamer-face ((t :foreground "#7aa2cf"
                     :background nil
                     :height 1
                     :italic nil))))
#+end_src

*** Git link

Provides URLs to GitHub/GitLab commits, PRs, etc. Details TBD

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package git-link
    :ensure t
    :custom
    (git-link-use-commit t)
    (git-link-open-in-browser t))
#+end_src

*** Git timemachine

Lets me browse a file's previous revisions, and therefore complements =diff-hl=, =Magit= and =Blamer=.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package git-timemachine
    :ensure t)
#+end_src

*** Provide Version Control

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (provide 'slp-vc)
#+end_src
